In [14]:
import pandas as pd 
fp = "https://bit.ly/missing-values"
data = pd.read_csv(fp)

In [15]:
data

      color  rating
0       NaN    1.16
1       Red     NaN
2      Blue    2.54
3       Red    1.51
4       Red     NaN
..      ...     ...
912    Blue    3.40
913     Red     NaN
914     NaN    1.24
915  Yellow    2.64
916    Blue     NaN

[917 rows x 2 columns]

In [16]:
data.isna().mean()

color     0.140676
rating    0.279171
dtype: float64

In [17]:
for nom_colonne in ['color', 'rating']:
    index_colonne = data.columns.get_loc(nom_colonne)
    data.insert(index_colonne+1,
                nom_colonne+'_nan',
                data[nom_colonne].isna().astype('int8'))

In [18]:
data

      color  color_nan  rating  rating_nan
0       NaN          1    1.16           0
1       Red          0     NaN           1
2      Blue          0    2.54           0
3       Red          0    1.51           0
4       Red          0     NaN           1
..      ...        ...     ...         ...
912    Blue          0    3.40           0
913     Red          0     NaN           1
914     NaN          1    1.24           0
915  Yellow          0    2.64           0
916    Blue          0     NaN           1

[917 rows x 4 columns]

In [19]:
# data = data.dropna(how='any',
#             subset=['color','rating'])

In [20]:
data

      color  color_nan  rating  rating_nan
0       NaN          1    1.16           0
1       Red          0     NaN           1
2      Blue          0    2.54           0
3       Red          0    1.51           0
4       Red          0     NaN           1
..      ...        ...     ...         ...
912    Blue          0    3.40           0
913     Red          0     NaN           1
914     NaN          1    1.24           0
915  Yellow          0    2.64           0
916    Blue          0     NaN           1

[917 rows x 4 columns]

In [21]:
data.rating.min()

1.0

In [22]:
data.rating.max()

5.0

In [23]:
data.rating.fillna(0)

0      1.16
1      0.00
2      2.54
3      1.51
4      0.00
       ...
912    3.40
913    0.00
914    1.24
915    2.64
916    0.00
Name: rating, Length: 917, dtype: float64

In [24]:
data

      color  color_nan  rating  rating_nan
0       NaN          1    1.16           0
1       Red          0     NaN           1
2      Blue          0    2.54           0
3       Red          0    1.51           0
4       Red          0     NaN           1
..      ...        ...     ...         ...
912    Blue          0    3.40           0
913     Red          0     NaN           1
914     NaN          1    1.24           0
915  Yellow          0    2.64           0
916    Blue          0     NaN           1

[917 rows x 4 columns]